Parser:
  Title: Network Session Event ASIM filtering parser for Sysmon (Event 3)
  Version: '0.0.1'
  LastUpdated: Nov 1, 2022
Product:
  Name: Windows Sysmon
Normalization:
  Schema: NetworkSession
  Version: '0.2.4'
References:
- Title: ASIM Network Session Schema
  Link: https://aka.ms/ASimNetworkSessionDoc
- Title: ASIM
  Link: https:/aka.ms/AboutASIM
Description: |
  This ASIM parser supports filtering and normalizing Sysmon network session events (event 3) collected using the Event or WEF (WindowsEvent table) connectors to the ASIM Process Event normalized schema. 
ParserName: vimNetworkSessionMicrosoftSysmon
EquivalentBuiltInParser: _Im_NetworkSession_MicrosoftSysmon
ParserParams:
  - Name: starttime
    Type: datetime
    Default: datetime(null)
  - Name: endtime
    Type: datetime
    Default: datetime(null)
  - Name: srcipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: ipaddr_has_any_prefix
    Type: dynamic
    Default: dynamic([])
  - Name: dstportnumber
    Type: int
    Default: int(null)
  - Name: hostname_has_any
    Type: dynamic
    Default: dynamic([])
  - Name: dvcaction
    Type: dynamic
    Default: dynamic([])
  - Name: eventresult
    Type: string
    Default: '*'
  - Name: disabled
    Type: bool
    Default: false
   ParserQuery: |
      let src_or_any=set_union(srcipaddr_has_any_prefix, ipaddr_has_any_prefix); 
      let dst_or_any=set_union(dstipaddr_has_any_prefix, ipaddr_has_any_prefix); 
      let ip_any = set_union(srcipaddr_has_any_prefix, dstipaddr_has_any_prefix, ipaddr_has_any_prefix);    
        let DirectionNetworkEvents =
            Event
              | where (isnull(starttime) or TimeGenerated>=starttime) 
                and (isnull(endtime) or TimeGenerated<=endtime) 
              | where not(disabled)
              | where Source == "Microsoft-Windows-Sysmon" and EventID==3
       
        let DirectionNetworkWindowsEvents =
            WindowsEvent
              | where (isnull(starttime) or TimeGenerated>=starttime) 
                and (isnull(endtime) or TimeGenerated<=endtime) 
              | where not(disabled)
              | where Provider == "Microsoft-Windows-Sysmon" and EventID == 3
    
    
